
let arr = [
    {title : `<b>अखेर कमाई<b>` ,content:
    `<br>
    <b>मध्यरात्र उलटल्यावर</b>
    <br>
    <b>शहरातील पाच पुतळे</b>
    <br>
    <b>एका चौथऱ्यावर बसले</b>
    <br>
    <b>आणि टिपं गाळू लागले .</b>
    <br>
    <b>ज्योतिबा म्हणाले ,शेवटी मी झालो</b>
    <br>
    <b>फ़क्त माळ्यांचा.</b>
    <br>
    <b>शिवाजीराजे म्हणाले ,</b>
    <br>
    <b>मी फ़क्त मराठ़्यांचा.</b>
    <br>
    <b>आंबेडकर म्हणाले ,</b>
    <br>
    <b>मी फ़क्त बौद्धांचा.</b>
    <br>
    <b>टिळक उद़्गारले ,</b>
    <br>
    <b>मी तर फ़क्त</b>
    <br>
    <b>चित्पावन ब्राम्हणांचा.</b>
    <br>
    <b>गांधींनी गळ्यातला गहिवर आवरला</b>
    <br>
    <b>आणि ते म्हणाले ,</b>
    <br>
    <b>तरी तुम्ही भाग्यवान.</b>
    <br>
    <b>एकेक जातजमात तरी</b>
    <br>
    <b>तुमच्या पाठीशी आहे.</b>
    <br>
    <b>माझ्या पाठीशी मात्र</b>
    <br>
    <b>फ़क्त सरकारी कचेऱ्यातील भिंती !</b>
    <hr>`},
    {
      title :`<b>पृथ्वीचे प्रेमगीत<b>` ,
      content :`
      <br>
      <b>युगामागुनी चालली रे युगे ही</b>
      <br>
      <b>करावी किती भास्करा वंचना</b>
      <br>
      <b>किती काळ कक्षेत धावू तुझ्या मी</b>
      <br>
      <b>कितीदा करु प्रीतीची याचना</b>
      <br>   
      <b>नव्हाळीतले ना उमाळे उसासे</b>     
      <br>
      <b>न ती आग अंगात आता उरे</b>
      <br>     
      <b>विझोनी आता यौवनाच्या मशाली</b>
      <br>      
      <b>ऊरी राहीले काजळी कोपरे</b>
      <br>    
      <b>परी अंतरी प्रीतीची ज्योत जागे</b>
      <br>      
      <b>अविश्रांत राहील अन् जागती</b>
      <br>      
      <b>न जाणे न येणे कुठे चालले मी</b>
      <br>      
      <b>कळे तू पुढे आणि मी मागुती
      <br>      
      <b>दिमाखात तारे नटोनी थटोनी
      <br>     
      <b>शिरी टाकिती दिव्य उल्काफुले
      <br>      
      <b>परंतु तुझ्या मूर्तीवाचून देवा</b>
      <br>
      <b>मला वाटते विश्व अंधारले</b>
      <br>
      <b>तुवा सांडलेले कुठे अंतराळात</b>
      <br>
      <b>वेचूनिया दिव्य तेजःकण</b>
      <br>
      <b>मला मोहवाया बघे हा सुधांशू</b>
      <br>
      <b>तपाचार स्वीकारुनी दारुण</b>
      <br>
      <b>निराशेत सन्यस्थ होऊन बैसे</b>
      <br>
      <b>ऋषींच्या कुळी उत्तरेला ध्रृव</b>
      <br> 
      <b>पिसाटापरी केस पिंजारुनी हा</b>
      <br>  
      <b>करी धूमकेतू कधी आर्जव</b>
      <br>  
      <b>पिसारा प्रभेचा उभारून दारी</b>
      <br>  
      <b>पहाटे उभा शुक्र हा प्रेमळ</b>
      <br>  
      <b>करी प्रीतीची याचना लाजुनी</b>
      <br>    
      <b>लाल होऊनिया लाजरा मंगळ</b>
      <br>    
      <b>परी दिव्य ते तेज पाहून पूजून</b>
      <br>   
      <b>घेऊ गळ्याशी कसे काजवे</b>
      <br>     
      <b>नको क्षूद्र शृंगार तो दुर्बळांचा</b>
      <br>     
      <b>तुझी दूरता त्याहुनी साहवे</b>
      <br>     
      <b>तळी जागणारा निखारा उफाळून</b>
      <br>     
      <b>येतो कधी आठवाने वर</b>
      <br>
      <b>शहारून येते कधी अंग तूझ्या</b>
      <br>    
      <b>स्मृतीने उले अन् सले अंतर</b>
      <br>     
      <b>गमे की तुझ्या रुद्र रूपात जावे</b>
      <br>     
      <b>मिळोनी गळा घालुनीया गळा</b>
      <br>     
      <b>तुझ्या लाल ओठातली आग प्यावी</b>
      <br>     
      <b>मिठीने तुझ्या तीव्र व्हाव्या कळा</b>     
      <br>      
      <b>अमर्याद मित्रा तुझी थोरवी अन्</b>
      <br>      
      <b>मला ज्ञात मी एक धुलिःकण</b>
      <br>
      <b>अलंकारण्याला परी पाय तूझे</b>
      <br>
      <b>धुळीचेच आहे मला भूषण </b>
      <hr>`
    }
    ,
    {
      title :`<b>वेडात मराठे वीर दौडले सात</b>` ,
      content :`
      <br>
      <b>वेडात मराठे वीर दौडले सात ॥ धृ. ॥</b><br>
      
      <b>“श्रुती धन्य जाहल्या, श्रवुनी अपुली वार्ता</b><br>
      <b>रण सोडूनी सेनासागर अमुचे पळता</b><br>
      <b>अबलाही घरोघर खऱ्या लाजतील आता</b><br>
      <b>भर दिवसा आम्हा, दिसू लागली रात”</b><br>
      <b>वेडात मराठे वीर दौडले सात… ॥ १ ॥</b><br>
      <br>
      <b>ते कठोर अक्षर एक एक त्यातील</b><br>
      <b>जाळीत चालले कणखर ताठर दील”</b><br>
      <b>माघारी वळणे नाही मराठी शील</b><br>
      <b>विसरला महाशय काय लावता जात</b><br>
      <b>वेडात मराठे वीर दौडले सात… ॥ २ ॥</b><br>
      <br>
      <b>वर भिवयी चढली, दात दाबिती ओठ</b><br>
      <b>छातीवर तुटली पटबंधाची गाठ</b><br>
      <b>डोळ्यांत उठे काहूर, ओलवे काठ</b><br>
      <b>म्यानातून उसळे तलवारीची पात</b><br>
      <b>वेडात मराठे वीर दौडले सात… ॥ ३ ॥</b><br>
      <br>
      <b>“जरी काल दाविली प्रभू, गनिमांना पाठ</b><br>
      <b>जरी काल विसरलो जरा मराठी जात</b><br>
      <b>हा असा धावतो आज अरि-शिबिरात</b><br>
      <b>तव मानकरी हा घेऊनी शिर करांत”</b><br>
      <b>वेडात मराठे वीर दौडले सात… ॥ ४ ॥</b><br>
      <br>
      <b>ते फिरता बाजूस डोळे, किंचित ओले</b><br>
      <b>सरदार सहा, सरसावूनी उठले शेले</b><br>
      <b>रिकिबीत टाकले पाय, झेलले भाले</b><br>
      <b>उसळले धुळीचे मेघ सात, निमिषांत</b><br>
      <b>वेडात मराठे वीर दौडले सात… ॥ ५ ॥</b><br>
      <br>
      <b>आश्चर्यमुग्ध टाकून मागुती सेना</b><br>
      <b>अपमान बुजविण्या सात अर्पूनी माना</b><br>
      <b>छावणीत शिरले थेट भेट गनिमांना</b><br>
      <b>कोसळल्या उल्का जळत सात, दर्यात</b><br>
      <b>वेडात मराठे वीर दौडले सात… ॥ ६ ॥</b><br>
      <br>
      <b>खालून आग, वर आग, आग बाजूंनी</b><br>
      <b>समशेर उसळली सहस्र क्रूर इमानी</b><br>
      <b>गर्दीत लोपले सात जीव ते मानी</b><br>
      <b>खग सात जळाले अभिमानी वणव्यात</b><br>
      <b>वेडात मराठे वीर दौडले सात… ॥ ७ ॥</b><br>
      <br>
      <b>दगडांवर दिसतील अजून तेथल्या टाचा</b><br>
      <b>ओढ्यात तरंगे अजूनी रंग रक्ताचा</b><br>
      <b>क्षितिजावर उठतो अजूनी मेघ मातीचा</b><br>
      <b>अद्याप विराणि कुणी वाऱ्यावर गात</b><br>
      <b>वेडात मराठे वीर दौडले सात… ॥ ८ ॥</b><br>
      <br>
      <hr>`
    }
    ,
    {
      title :`<b>क्रांतीचा जयजयकार<b/>` ,
      content :`
      <br>
      <b>गर्जा जयजयकार क्रांतीचा गर्जा जयजयकार</b><br>
      <b>अन् वज्रांचे छातीवरती घ्या झेलून प्रहार!</b><br>
      <b>खळखळू द्या या अदय शृंखला हातापायांत</b><br>
      <b>पोलादाची काय तमा मरणाच्या दारात?</b><br>
      <b>सर्पांनो उद्दाम आवळा, करकचूनिया पाश</b><br>
      <b>पिचेल मनगट परि उरातील अभंग आवेश</b><br>
      <b>तडिताघाते कोसळेल का तारांचा संभार</b><br>
      <b>कधीही तारांचा संभार</b><br>
      <b>गर्जा जयजयकार क्रांतीचा गर्जा जयजयकार!</b><br>
      <b>क्रुद्ध भूक पोटात घालू द्या खुशाल थैमान</b><br>
      <b>कुरतडू द्या आतडी करू द्या रक्ताचे पान</b><br>
      <b>संहारक काली, तुज देती बळीचे आव्हान</b><br>
      <b>बलशाली मरणाहून आहे अमुचा अभिमान</b><br>
      <b>मृत्यूंजय आम्ही! आम्हाला कसले कारागार?</b><br>
      <b>अहो हे कसले कारागार?</b><br>
      <b>गर्जा जयजयकार क्रांतीचा गर्जा जयजयकार!</b><br>
      <b>पदोपदी पसरून निखारे आपुल्याच हाती</b><br>
      <b>होऊनिया बेहोष धावलो ध्येयपथावरती</b><br>
      <b>कधी न थांबलो विश्रांतीस्तव, पाहिले न मागे</b><br>
      <b>बांधू न शकले प्रीतीचे वा कीर्तीचे धागे</b><br>
      <b>एकच ताळा समोर आणिक पायतळी अंगार</b><br>
      <b>होता पायतळी अंगार</b><br>
      <b>गर्जा जयजयकार क्रांतीचा गर्जा जयजयकार!</b><br>
      <b>नाचविता ध्वज तुझा गुंतले शृंखलेत हात</b><br>
      <b>तुझ्या यशाचे पवाड गाता गळ्यात ये तात</b><br>
      <b>चरणांचे तव पूजन केले म्हणुनी गुन्हेगार</b><br>
      <b>देता जीवन-अर्घ्य तुला ठरलो वेडेपीर</b><br>
      <b>देशील ना पण तुझ्या कुशीचा वेड्यांना आधार</b><br>
      <b>आई वेड्यांना आधार</b><br>
      <b>गर्जा जयजयकार क्रांतीचा गर्जा जयजयकार!</b><br>
      <b>कशास आई, भिजविसी डोळे, उजळ तुझे भाल</b><br>
      <b>रात्रीच्या गर्भात उद्याचा असे उषःकाल</b><br>
      <b>सरणावरती आज अमुची पेटता प्रेते</b><br>
      <b>उठतील त्या ज्वालांतून क्रांतीचे नेते</b><br>
      <b>लोहदंड तव पायांमधले खळखळा तुटणार</b><br>
      <b>आई, खळखळा तुटणार</b><br>
      <b>गर्जा जयजयकार क्रांतीचा गर्जा जयजयकार!</b><br>
      <b>आता कर ॐकारा तांडव गिळावया घास</b><br>
      <b>नाचत गर्जत टाक बळींच्या गळ्यावरी फास</b><br>
      <b>रक्तमांस लुटण्यास गिधाडे येऊ देत क्रूर</b><br>
      <b>पहा मोकळे केले आता त्यासाठी ऊर</b><br>
      <b>शरीरांचा कर या सुखेनैव या सुखेनैव संहार</b><br>
      <b>मरणा, सुखेनैव संहार</b><br>
      <b>गर्जा जयजयकार क्रांतीचा गर्जा क्रांतीचा जयजयकार</b><br>
      <br>
      <hr>
      `
    }
    ,
    {
      title :`<b>स्वातंत्र्यदेवीची विनवणी<b/>` ,
      content :`
      <br>
      <b>पन्नाशीची उमर गाठली अभिवादन मज करू नका ।</b><br>
      <br>
      <b>मीच विनविते हात जोडूनी वाट वाकडी धरू नका ॥</b><br>
      <br>
      <b>सूर्यकुलाचा दिव्य वारसा प्रिय पुत्रांनो तुम्हा मिळे ।</b><br>
      <br>
      <b>काळोखाचे करून पूजन घुबडांचे व्रत करू नका ॥</b><br>
      <br>
      <b>अज्ञानाच्या गळ्यात माळा अभिमानाच्या घालू नका ।</b><br>
      <br>
      <b>अंध प्रथांच्या कुजट कोठारी दिवाभीतासम दडू नका ॥</b><br>
      <br>
      <b>जुनाट पाने गळून पालवी नवी फुटे हे ध्यानी धरा ।</b><br>
      <br>
      <b>एकविसावे शतक समोरी सोळाव्यास्तव रडू नका ॥</b><br>
      <br>
      <b>वेतन खाऊन काम टाळणे हा देशाचा द्रोह असे ।</b><br>
      <br>
      <b>करतील दुसरे, बघतील तिसरे असे सांगुनी सुटू नका ॥</b><br>
      <br>
      <b>जनसेवेस्तव असे कचेरी ती डाकूंची नसे गुहा ।</b><br>
      <br>
      <b>मेजाखालून, मेजावरतून द्रव्य कुणाचे लुटू नका ॥</b><br>
      <br>
      <b>बोथट पुतळे पथापथावर ही थोरांची विटंबना ।</b><br>
      <br>
      <b>कणभर त्यांचा मार्ग अनुसरा, वांझ गोडवे गाऊ नका ॥</b><br>
      <br>
      <b>सत्ता तारक सुधा असे पण सुराही मादक सहज बने ।</b><br>
      <br>
      <b>करीन मंदिरी मी मदिरालय अशी प्रतिज्ञा घेऊ नका ॥</b><br>
      <br>
      <b>प्रकाश पेरा अपुल्या भवती दिवा दिव्याने पेटतसे ।</b><br>
      <br>
      <b>इथे भ्रष्टता, तिथे नष्टता, शंखच पोकळ फुंकू नका ॥</b><br>
      <br>
      <b>पाप कृपणता, पुण्य सदयता, संतवाक्य हे सदा स्मरा ।</b><br>
      <br>
      <b>भलेपणाचे कार्य उगवता कुठे तयावर भुंकू नका ॥</b>
      <br>
      <hr>
      `
    }
    ,
    {
      title :`<b>निरोप</b>` ,
      content :`
      <br>
      गर्दीत बाणासम ती घुसोनि
      <br><b>चाले, ऊरेना लव देहभान</b>
      <br><b>दोन्ही करांनी कवटाळूनीया</b>
      <br><b>वक्ष:स्थळी बालक ते लहान</b>
      <br><b>लज्जा न, संकोच नसे, न भीती</b>
      <br><b>हो दहन ते स्त्रीपण संगरात</b>
      <br><b>आता ऊरे जीवनसूत्र एक</b>
      <br><b>गुंतोनी राहे मन मात्र त्यात</b>
      <br>
      बाजार येथे जमला बळींचा
      <br><b>तेथेही जागा धनिकांस आधी</b>
      <br><b>आधार अश्रूसही दौलतीचा</b>
      <br><b>दारिद्र्य दु:खा दुसरी उपाधी</b>
      <br><b>चिंध्या शरीरावरी सावरोनी</b>
      <br><b>राहे जमावात जरा उभी ती</b>
      <br><b>कोणी पहावे अथवा पुसावे?</b>
      <br>
      एकाच शापातून सर्व जाती
      <br><b>निर्धार केला कसला मानसी</b>
      <br><b>झेपाउनी ये ठिणगीप्रमाणे</b>
      <br><b>फेकूनिया बाळ दिले विमाने</b>
      <br><b>व्हावे पुढे काय प्रभूच जाणे</b>
      <br>
      “जा बाळा जा, वणव्यातुनी या
      <br><b>पृथ्वीच आई पुढती तुझी रे</b>
      <br><b>आकाश घेईं तुजला कवेंत</b>
      <br><b>दाही दिशांचा तुज आसरा रे”</b>
      <br>
      ठावे न कोठे मग काय झाले
      <br><b>गेले जळोनीं मन मानवाचे</b>
      <br><b>मांगल्य सारे पडले धुळीत</b>
      <br><b>चोहीकडे नर्तन हिंस्त्रतेचे!</b>
      <br>
      <hr>`
    }
    ,
    {
      title :`<b>कणा</b>` ,
      content :`
      <br>
      “ओळखलत क सर मला?” पावसात आला कोणी,
      <br><b>कपडे होते कर्दमलेले, केसांवरती पाणी.</b>
      <br><b>क्षणभर बसला नंतर हसला बोलला वरती पाहून,</b>
      <br><b>“गंगामाई पाहुणी आली, गेली घरट्यात राहुन.”</b>
      <br>
      माहेरवाशिणीसारखी चार भिंतीत नाचली,
      <br><b>मोकळ्या हाती जाईल कशी, बायको मात्र वाचली.</b>
      <br><b>भिंत खचली, चूल विझली, होते नव्हते नेले,</b>
      <br><b>प्रसाद म्हणून पापण्यांवरती पाणी थोडे ठेवले.</b>
      <br>
      खिशाकडे हात जाताच हसत हसत उठला
      <br><b>“पैसे नकोत सर”, जरा एकटेपणा वाटला.</b>
      <br><b>कारभारणीला घेउन संगे सर आता लढतो आहे**
      <br><b>पडकी भिंत बांधतो आहे, चिख्लगाळ काढतो आहे ,</b>
      <br>
      मोडून पडला संसार तरी मोडला नाही कणा
      <br><b>पाठीवरती हात ठेउन, तुम्ही फक्‍त लढ म्हणा !</b>
      <hr>`
    }
]

var maincontainer = document.getElementById("maincontainer");
var poemtitle = document.getElementById("poemtitle")
var poemcontent = document.getElementById("poem-content");
var entrycode = false;
var poemId = 0;

addEventListener("click" , (ele)=>{
    let target = ele.target;
    let target_title = target.innerText;
   
    switch(target_title){

      case 'अखेर कमाई':
        poemId = 0;
        entrycode = true;
        break;
      case 'पृथ्वीचे प्रेमगीत':
        poemId = 1;
        entrycode = true;
        break;
      case 'वेडात मराठे वीर दौडले सात':
        poemId = 2;
        entrycode = true;
        break;
      case 'क्रांतीचा जयजयकार':
        poemId = 3;
        entrycode = true;
        break;
      case 'स्वातंत्र्यदेवीची विनवणी':
        poemId = 4;
        entrycode = true;
        break;    
      case 'निरोप':
        poemId = 5;
        entrycode = true;
        break;    
      case 'कणा':
        poemId = 6;
        entrycode = true;
        break;    

      default :
        entrycode = false;
        break;
    }
    if(entrycode === true){
    poemtitle.innerHTML  = `${arr[poemId].title}`;
    poemcontent.innerHTML = `${arr[poemId].content}` 
    }
});

// zoom in functionality
document.getElementById("zoomIn").addEventListener("click" , ()=>{
  poemcontent.style.transform = "scale(1.5)";
  poemcontent.style.backgroundColor = "rgb(34, 21, 47)";
  poemcontent.style.color = "rgb(176, 171, 164)";
});
// zoom out functionality
document.getElementById("zoomOut").addEventListener("click" , ()=>{
  poemcontent.style.transform = "scale(1)";
  poemcontent.style.backgroundColor = "rgba(210, 214, 216, 0.1)";
  poemcontent.style.color = "blueviolet";
});

//font increase 
document.getElementById("fontinc").addEventListener("click" , ()=>{
  var style = window.getComputedStyle(poemcontent, null).getPropertyValue('font-size');
  var fontSize = parseFloat(style); 
  poemcontent.style.fontSize = (fontSize + 1) + 'px';
});
//font decrease 
document.getElementById("fontdec").addEventListener("click" , ()=>{
  var style = window.getComputedStyle(poemcontent, null).getPropertyValue('font-size');
  var fontSize = parseFloat(style); 
  poemcontent.style.fontSize = (fontSize - 1) + 'px';
});
//font style italic
document.getElementById("italicFont").addEventListener("click" , ()=>{ 
  poemcontent.style.fontStyle = "italic";
});
//font style normal
document.getElementById("normalfont").addEventListener("click" , ()=>{ 
  poemcontent.style.fontStyle = "normal";
});
